Results/Verifications/S2427/read_only/tidb-server-thead-c906.sysbench.log
sysbench 1.0.20 (using system LuaJIT 2.1.1700206165)

Running the test with following options:
Number of threads: 12
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 12 tps: 190.59 qps: 3062.30 (r/w/o: 2680.02/0.00/382.29) lat (ms,95%): 80.03 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 12 tps: 196.22 qps: 3139.12 (r/w/o: 2746.68/0.00/392.44) lat (ms,95%): 82.96 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 12 tps: 192.00 qps: 3073.63 (r/w/o: 2689.54/0.00/384.09) lat (ms,95%): 81.48 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 12 tps: 203.90 qps: 3263.00 (r/w/o: 2855.20/0.00/407.80) lat (ms,95%): 68.05 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 12 tps: 191.40 qps: 3060.10 (r/w/o: 2677.30/0.00/382.80) lat (ms,95%): 77.19 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 12 tps: 195.10 qps: 3121.23 (r/w/o: 2731.02/0.00/390.20) lat (ms,95%): 78.60 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 12 tps: 187.50 qps: 3002.60 (r/w/o: 2627.60/0.00/375.00) lat (ms,95%): 81.48 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 12 tps: 195.20 qps: 3120.07 (r/w/o: 2729.67/0.00/390.40) lat (ms,95%): 78.60 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 12 tps: 183.40 qps: 2936.20 (r/w/o: 2569.40/0.00/366.80) lat (ms,95%): 86.00 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 12 tps: 185.50 qps: 2965.89 (r/w/o: 2594.99/0.00/370.90) lat (ms,95%): 86.00 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 12 tps: 192.30 qps: 3078.71 (r/w/o: 2694.01/0.00/384.70) lat (ms,95%): 82.96 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 12 tps: 192.70 qps: 3083.72 (r/w/o: 2698.32/0.00/385.40) lat (ms,95%): 87.56 err/s: 0.00 reconn/s: 0.00
[ 130s ] thds: 12 tps: 195.30 qps: 3125.57 (r/w/o: 2734.97/0.00/390.60) lat (ms,95%): 90.78 err/s: 0.00 reconn/s: 0.00
[ 140s ] thds: 12 tps: 199.02 qps: 3181.69 (r/w/o: 2783.66/0.00/398.04) lat (ms,95%): 77.19 err/s: 0.00 reconn/s: 0.00
[ 150s ] thds: 12 tps: 193.78 qps: 3100.31 (r/w/o: 2712.85/0.00/387.46) lat (ms,95%): 86.00 err/s: 0.00 reconn/s: 0.00
[ 160s ] thds: 12 tps: 205.70 qps: 3293.53 (r/w/o: 2882.03/0.00/411.50) lat (ms,95%): 65.65 err/s: 0.00 reconn/s: 0.00
[ 170s ] thds: 12 tps: 198.50 qps: 3173.80 (r/w/o: 2776.80/0.00/397.00) lat (ms,95%): 77.19 err/s: 0.00 reconn/s: 0.00
[ 180s ] thds: 12 tps: 191.50 qps: 3066.87 (r/w/o: 2683.88/0.00/383.00) lat (ms,95%): 86.00 err/s: 0.00 reconn/s: 0.00
[ 190s ] thds: 12 tps: 196.50 qps: 3141.92 (r/w/o: 2748.92/0.00/393.00) lat (ms,95%): 81.48 err/s: 0.00 reconn/s: 0.00
[ 200s ] thds: 12 tps: 200.30 qps: 3204.31 (r/w/o: 2803.71/0.00/400.60) lat (ms,95%): 73.13 err/s: 0.00 reconn/s: 0.00
[ 210s ] thds: 12 tps: 197.20 qps: 3154.86 (r/w/o: 2760.57/0.00/394.30) lat (ms,95%): 74.46 err/s: 0.00 reconn/s: 0.00
[ 220s ] thds: 12 tps: 195.30 qps: 3127.10 (r/w/o: 2736.40/0.00/390.70) lat (ms,95%): 81.48 err/s: 0.00 reconn/s: 0.00
[ 230s ] thds: 12 tps: 188.83 qps: 3018.12 (r/w/o: 2640.47/0.00/377.65) lat (ms,95%): 84.47 err/s: 0.00 reconn/s: 0.00
[ 240s ] thds: 12 tps: 204.27 qps: 3268.08 (r/w/o: 2859.73/0.00/408.35) lat (ms,95%): 68.05 err/s: 0.00 reconn/s: 0.00
[ 250s ] thds: 12 tps: 197.90 qps: 3168.31 (r/w/o: 2772.41/0.00/395.90) lat (ms,95%): 80.03 err/s: 0.00 reconn/s: 0.00
[ 260s ] thds: 12 tps: 198.00 qps: 3168.31 (r/w/o: 2772.20/0.00/396.10) lat (ms,95%): 81.48 err/s: 0.00 reconn/s: 0.00
[ 270s ] thds: 12 tps: 199.60 qps: 3195.58 (r/w/o: 2796.38/0.00/399.20) lat (ms,95%): 78.60 err/s: 0.00 reconn/s: 0.00
[ 280s ] thds: 12 tps: 206.70 qps: 3303.43 (r/w/o: 2890.02/0.00/413.40) lat (ms,95%): 65.65 err/s: 0.00 reconn/s: 0.00
[ 290s ] thds: 12 tps: 191.00 qps: 3057.90 (r/w/o: 2675.90/0.00/382.00) lat (ms,95%): 81.48 err/s: 0.00 reconn/s: 0.00
[ 300s ] thds: 12 tps: 193.30 qps: 3093.59 (r/w/o: 2707.00/0.00/386.60) lat (ms,95%): 82.96 err/s: 0.00 reconn/s: 0.00
[ 310s ] thds: 12 tps: 200.30 qps: 3203.09 (r/w/o: 2802.59/0.00/400.50) lat (ms,95%): 69.29 err/s: 0.00 reconn/s: 0.00
[ 320s ] thds: 12 tps: 189.20 qps: 3029.02 (r/w/o: 2650.52/0.00/378.50) lat (ms,95%): 84.47 err/s: 0.00 reconn/s: 0.00
[ 330s ] thds: 12 tps: 192.30 qps: 3075.67 (r/w/o: 2691.08/0.00/384.60) lat (ms,95%): 81.48 err/s: 0.00 reconn/s: 0.00
[ 340s ] thds: 12 tps: 198.10 qps: 3170.42 (r/w/o: 2774.21/0.00/396.20) lat (ms,95%): 70.55 err/s: 0.00 reconn/s: 0.00
[ 350s ] thds: 12 tps: 187.40 qps: 2998.69 (r/w/o: 2623.89/0.00/374.80) lat (ms,95%): 87.56 err/s: 0.00 reconn/s: 0.00
[ 360s ] thds: 12 tps: 196.40 qps: 3141.32 (r/w/o: 2748.52/0.00/392.80) lat (ms,95%): 82.96 err/s: 0.00 reconn/s: 0.00
[ 370s ] thds: 12 tps: 205.50 qps: 3287.78 (r/w/o: 2876.88/0.00/410.90) lat (ms,95%): 68.05 err/s: 0.00 reconn/s: 0.00
[ 380s ] thds: 12 tps: 196.50 qps: 3145.19 (r/w/o: 2752.09/0.00/393.10) lat (ms,95%): 84.47 err/s: 0.00 reconn/s: 0.00
[ 390s ] thds: 12 tps: 197.20 qps: 3154.30 (r/w/o: 2759.90/0.00/394.40) lat (ms,95%): 78.60 err/s: 0.00 reconn/s: 0.00
[ 400s ] thds: 12 tps: 199.20 qps: 3187.09 (r/w/o: 2788.69/0.00/398.40) lat (ms,95%): 68.05 err/s: 0.00 reconn/s: 0.00
[ 410s ] thds: 12 tps: 185.80 qps: 2972.81 (r/w/o: 2601.21/0.00/371.60) lat (ms,95%): 92.42 err/s: 0.00 reconn/s: 0.00
[ 420s ] thds: 12 tps: 193.40 qps: 3091.82 (r/w/o: 2705.02/0.00/386.80) lat (ms,95%): 84.47 err/s: 0.00 reconn/s: 0.00
[ 430s ] thds: 12 tps: 185.50 qps: 2971.78 (r/w/o: 2600.78/0.00/371.00) lat (ms,95%): 78.60 err/s: 0.00 reconn/s: 0.00
[ 440s ] thds: 12 tps: 189.60 qps: 3033.90 (r/w/o: 2654.70/0.00/379.20) lat (ms,95%): 86.00 err/s: 0.00 reconn/s: 0.00
[ 450s ] thds: 12 tps: 186.20 qps: 2977.80 (r/w/o: 2605.50/0.00/372.30) lat (ms,95%): 80.03 err/s: 0.00 reconn/s: 0.00
[ 460s ] thds: 12 tps: 189.00 qps: 3024.30 (r/w/o: 2646.30/0.00/378.00) lat (ms,95%): 81.48 err/s: 0.00 reconn/s: 0.00
[ 470s ] thds: 12 tps: 186.80 qps: 2990.70 (r/w/o: 2617.00/0.00/373.70) lat (ms,95%): 97.55 err/s: 0.00 reconn/s: 0.00
[ 480s ] thds: 12 tps: 202.71 qps: 3242.11 (r/w/o: 2836.68/0.00/405.43) lat (ms,95%): 68.05 err/s: 0.00 reconn/s: 0.00
[ 490s ] thds: 12 tps: 194.39 qps: 3108.40 (r/w/o: 2719.62/0.00/388.77) lat (ms,95%): 84.47 err/s: 0.00 reconn/s: 0.00
[ 500s ] thds: 12 tps: 204.50 qps: 3274.30 (r/w/o: 2865.30/0.00/409.00) lat (ms,95%): 66.84 err/s: 0.00 reconn/s: 0.00
[ 510s ] thds: 12 tps: 194.30 qps: 3107.69 (r/w/o: 2719.19/0.00/388.50) lat (ms,95%): 84.47 err/s: 0.00 reconn/s: 0.00
[ 520s ] thds: 12 tps: 190.80 qps: 3050.43 (r/w/o: 2668.73/0.00/381.70) lat (ms,95%): 87.56 err/s: 0.00 reconn/s: 0.00
[ 530s ] thds: 12 tps: 203.00 qps: 3248.70 (r/w/o: 2842.70/0.00/406.00) lat (ms,95%): 68.05 err/s: 0.00 reconn/s: 0.00
[ 540s ] thds: 12 tps: 182.70 qps: 2924.68 (r/w/o: 2559.28/0.00/365.40) lat (ms,95%): 87.56 err/s: 0.00 reconn/s: 0.00
[ 550s ] thds: 12 tps: 191.30 qps: 3060.02 (r/w/o: 2677.52/0.00/382.50) lat (ms,95%): 80.03 err/s: 0.00 reconn/s: 0.00
[ 560s ] thds: 12 tps: 187.70 qps: 3002.30 (r/w/o: 2626.80/0.00/375.50) lat (ms,95%): 87.56 err/s: 0.00 reconn/s: 0.00
[ 570s ] thds: 12 tps: 168.30 qps: 2694.90 (r/w/o: 2358.30/0.00/336.60) lat (ms,95%): 92.42 err/s: 0.00 reconn/s: 0.00
[ 580s ] thds: 12 tps: 190.80 qps: 3053.08 (r/w/o: 2671.49/0.00/381.60) lat (ms,95%): 86.00 err/s: 0.00 reconn/s: 0.00
[ 590s ] thds: 12 tps: 188.90 qps: 3022.22 (r/w/o: 2644.42/0.00/377.80) lat (ms,95%): 81.48 err/s: 0.00 reconn/s: 0.00
[ 600s ] thds: 12 tps: 185.70 qps: 2970.77 (r/w/o: 2599.38/0.00/371.40) lat (ms,95%): 92.42 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            1627262
        write:                           0
        other:                           232466
        total:                           1859728
    transactions:                        116233 (193.70 per sec.)
    queries:                             1859728 (3099.23 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          600.0570s
    total number of events:              116233

Latency (ms):
         min:                                   46.47
         avg:                                   61.94
         max:                                  529.41
         95th percentile:                       81.48
         sum:                              7199776.42

Threads fairness:
    events (avg/stddev):           9686.0833/10.86
    execution time (avg/stddev):   599.9814/0.02